Revit 2027 API
CategoryNameMap.GetEnumerator Method
Retrieve a forward moving iterator to the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator
public:
virtual IEnumerator^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator
override GetEnumerator : unit -> IEnumerator
Return Value
IEnumerator
Returns a forward moving iterator to the map.
Implements
IEnumerable.GetEnumerator()
See Also
Reference
CategoryNameMap Class
Autodesk.Revit.DB Namespace